{"_path":"/dir/gevurtz_menashe","_dir":"dir","_draft":false,"_partial":false,"_locale":"","title":"Gevurtz Menashe","description":"Expert estate planning and family law services for peace of mind and future security.","featured":false,"invert":true,"card_image":"logo-wide-white_2.png","tags":["Charitable Trusts","Family Law","Tax Planning","Asset Protection","Probate Services","Wills Lawyer","Trust Administration","Estate Planning"],"body":{"type":"root","children":[{"type":"element","tag":"div","props":{"align":"center"},"children":[{"type":"element","tag":"a","props":{"href":"https://gevurtzmenashe.com/estate-planning/"},"children":[{"type":"element","tag":"img","props":{"src":"logo-wide-white_2.png","alt":"Logo","style":"min-width: 200px; max-width: 600px; height: auto;","className":["invert"]},"children":[]}]}]},{"type":"element","tag":"h1","props":{"id":"gevurtz-menashe"},"children":[{"type":"text","value":"Gevurtz Menashe"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://gevurtzmenashe.com/estate-planning/"},"children":[{"type":"text","value":"Visit Website"}]},{"type":"element","tag":"br","props":{},"children":[]},{"type":"element","tag":"br","props":{},"children":[]},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Expert estate planning and family law services for peace of mind and future security."}]}]},{"type":"element","tag":"h2","props":{"id":"overview"},"children":[{"type":"text","value":"Overview"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Gevurtz Menashe is a prestigious law firm based in the Pacific Northwest, specializing in estate planning and family law services. The firm distinguishes itself with a team of experienced attorneys dedicated to providing comprehensive legal assistance. It holds a significant position in the Oregon and Washington legal markets, recognized for helping clients navigate complex legal scenarios with expertise and compassion. Known for its client-centric approach, Gevurtz Menashe ensures personalized legal solutions tailored to individual needs."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"With a strong reputation built over years of practice, Gevurtz Menashe remains a go-to firm for individuals seeking legal counsel in family law and estate planning. Their commitment to quality, professionalism, and personalized attention sets them apart in the legal industry. Clients appreciate their thorough and empathetic approach, which contributes to successful legal outcomes."}]},{"type":"element","tag":"h2","props":{"id":"products-services"},"children":[{"type":"text","value":"Products & Services"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Gevurtz Menashe offers a wide array of legal services covering family law, estate planning, and family creation. In family law, they handle matters such as divorce, child custody, military divorce, and prenuptial agreements, offering specialized services for complex situations like international child custody. In estate planning, the firm assists with asset protection, probate administration, and setting up trusts, emphasizing planning for incapacity and beneficiary selection."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Additionally, Gevurtz Menashe helps with family creation through adoption, surrogacy, and assisted reproductive technology legal services. The firm's estate planning services are designed to give clients peace of mind, ensuring their assets are well-protected and their wishes respected. They also offer unbundled legal services for clients who require specific support rather than comprehensive case management."}]},{"type":"element","tag":"h2","props":{"id":"company-details"},"children":[{"type":"text","value":"Company Details"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Gevurtz Menashe is headquartered in Portland and serves clients across Oregon and Washington. With a rich history in providing legal services, the firm has built a strong community presence and is actively involved in local initiatives. Their team comprises attorneys with varied expertise, ensuring clients receive well-rounded legal support."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The firm's offices are strategically located to serve both urban and rural clients in the region. Founded with the mission to deliver compassionate and skilled legal services, Gevurtz Menashe has grown to be a trusted name in the Pacific Northwest communities. They emphasize a seamless consultation process and transparent communication with clients, making high-quality legal representation accessible and straightforward."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"overview","depth":2,"text":"Overview"},{"id":"products-services","depth":2,"text":"Products & Services"},{"id":"company-details","depth":2,"text":"Company Details"}]}},"_type":"markdown","_id":"content:dir:Gevurtz_Menashe.md","_source":"content","_file":"dir/Gevurtz_Menashe.md","_stem":"dir/Gevurtz_Menashe","_extension":"md","sitemap":{"loc":"/dir/gevurtz_menashe"}}