{"_path":"/dir/the_mclario_firm","_dir":"dir","_draft":false,"_partial":false,"_locale":"","title":"The McLario Firm","description":"Client-centered legal guidance with a legacy of community commitment in Southeast Wisconsin.","featured":false,"invert":false,"card_image":"logo_18.png","tags":["Special Needs Planning","Litigation","Business Formation","Family Law","Real Estate Transactions","Tax Planning","Power of Attorney","Medicaid Planning","Elder Law","Asset Protection","Probate Services","Wills Lawyer","Trust Administration","Estate Planning"],"body":{"type":"root","children":[{"type":"element","tag":"div","props":{"align":"center"},"children":[{"type":"element","tag":"a","props":{"href":"https://mclario.com/practice-areas/estate-planning/"},"children":[{"type":"element","tag":"img","props":{"src":"logo_18.png","alt":"Logo","style":"min-width: 200px; max-width: 600px; height: auto;"},"children":[]}]}]},{"type":"element","tag":"h1","props":{"id":"the-mclario-firm"},"children":[{"type":"text","value":"The McLario Firm"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://mclario.com/practice-areas/estate-planning/"},"children":[{"type":"text","value":"Visit Website"}]},{"type":"element","tag":"br","props":{},"children":[]},{"type":"element","tag":"br","props":{},"children":[]},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Client-centered legal guidance with a legacy of community commitment in Southeast Wisconsin."}]}]},{"type":"element","tag":"h2","props":{"id":"overview"},"children":[{"type":"text","value":"Overview"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The McLario Firm, founded in 1953 by John J. McLario, is a well-established law firm located in Downtown Menomonee Falls, Wisconsin. With a client-first mentality, this Christian firm emphasizes providing honest and competent legal representation, focusing on serving the community through numerous educational seminars and charitable activities. McLario is considered a staple in the Southeastern Wisconsin legal landscape and is known for its commitment to client service and community involvement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The firm is a significant presence in the Milwaukee and surrounding communities, fostering a growth-oriented environment for its team. As a Christian-based organization, McLario values service and integrity, drawing on decades of experience to support its diverse client base. The firm's legal team is equipped to guide clients through a wide range of legal proceedings with a genuine spirit of service."}]},{"type":"element","tag":"h2","props":{"id":"products-services"},"children":[{"type":"text","value":"Products & Services"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"McLario Firm offers a diverse range of legal services, specializing in personal injury, family law, estate planning, real estate law, criminal law, and business entities. Each service is tailored to meet client needs, ensuring thorough and customized legal strategies. The firm prides itself on preparing clients for worst-case scenarios, aiming to provide peace of mind through comprehensive legal planning."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Estate planning services form a prominent part of McLario's offering, ensuring families are secure with detailed planning solutions. Additionally, the firm handles complex real estate transactions and business entity formations, ensuring legal compliance and strategic growth. Their personal injury and family law services provide supportive and robust representation, focusing on achieving favorable outcomes for their clients."}]},{"type":"element","tag":"h2","props":{"id":"company-details"},"children":[{"type":"text","value":"Company Details"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The McLario Firm is located in Menomonee Falls, Wisconsin, serving Milwaukee and the surrounding Southeastern Wisconsin communities. Since its inception in the late 1950s, the firm has grown into a prominent entity in the local legal market, supported by a team of seasoned attorneys and paralegals. McLario's market presence is enhanced by their commitment to community service and their Christian values which are central to their operation."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Known for its supportive work environment, McLario is continually looking to expand its team to better serve its clients. The firm recruits experienced attorneys and paralegals who align with their service-oriented approach, enabling them to grow their capabilities across diverse legal areas. The firm's community focus is evident in its support of numerous Milwaukee area organizations and causes, reinforcing its role as a significant community partner."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"overview","depth":2,"text":"Overview"},{"id":"products-services","depth":2,"text":"Products & Services"},{"id":"company-details","depth":2,"text":"Company Details"}]}},"_type":"markdown","_id":"content:dir:The_McLario_Firm.md","_source":"content","_file":"dir/The_McLario_Firm.md","_stem":"dir/The_McLario_Firm","_extension":"md","sitemap":{"loc":"/dir/the_mclario_firm"}}